---
kind: method
id: M:Autodesk.Revit.DB.Category.GetHashCode
source: html/422633b6-b8ad-dbc2-ff6e-b3a0c6f35e23.htm
---
# Autodesk.Revit.DB.Category.GetHashCode Method

## Syntax (C#)
```csharp
public override int GetHashCode()
```